**Алгоритм Беллмана-Форда** используется для нахождения кратчайших путей от одной вершины графа до всех остальных вершин, включая графы с отрицательными весами рёбер. Он работает, итеративно улучшая оценки кратчайших путей, проверяя рёбра  $|V|$ - 1  раз, где  $V$  — количество вершин графа.


## Основная идея

Алгоритм проверяет все рёбра графа, чтобы найти более короткие пути. За  $|V|$- 1  итерацию гарантируется, что все кратчайшие пути найдены, так как путь через максимум  $|V|$ - 1  рёбра достаточно для любой пары вершин.


## Входные данные

• **Граф:**  $G = (V, E)$ , где  $V$  — вершины,  $E$  — рёбра с весами.
• **Источник:** Вершина  $S$ , откуда начинается поиск.


## Шаги алгоритма

1. Инициализация:
	1. Задать  $dist[v] = \infty$  для всех вершин  $v$ , кроме источника ( $dist[S] = 0$ ).
2. Расслабление рёбер:
	1. Повторить  $|V|$ - 1  раз:
		1. Для каждого ребра  ($u, v, w$)  (вес ребра  $w$ ):
			1. Если  $dist[u] + w < dist[v]$ , то обновить  $dist[v] = dist[u] + w$ .
3. Проверка на циклы:
	1. Выполнить ещё одну итерацию по всем рёбрам:
		1. Если найдётся ребро, которое можно “расслабить”, значит, граф содержит цикл отрицательного веса.


## Имплементация

``` java
import java.util.*;

class BellmanFordAlgorithm {
    static class Edge {
        int src, dest, weight;
        Edge(int src, int dest, int weight) {
            this.src = src;
            this.dest = dest;
            this.weight = weight;
        }
    }
	
    public static void bellmanFord(int vertices, List<Edge> edges, int source) {
        int[] dist = new int[vertices];
        Arrays.fill(dist, Integer.MAX_VALUE);
        dist[source] = 0;
        // Расслабляем рёбра |V| - 1 раз
        for (int i = 0; i < vertices - 1; i++) {
            for (Edge edge : edges) {
                if (dist[edge.src] != Integer.MAX_VALUE && dist[edge.src] + edge.weight < dist[edge.dest]) {
                    dist[edge.dest] = dist[edge.src] + edge.weight;
                }
            }
        }
        // Проверка на отрицательные циклы
        for (Edge edge : edges) {
            if (dist[edge.src] != Integer.MAX_VALUE && dist[edge.src] + edge.weight < dist[edge.dest]) {
                System.out.println("Граф содержит отрицательный цикл.");
                return;
            }
        }
        // Вывод кратчайших расстояний
        System.out.println("Кратчайшие расстояния от вершины " + source + ":");
        for (int i = 0; i < vertices; i++) {
            System.out.println("До вершины " + i + ": " + (dist[i] == Integer.MAX_VALUE ? "∞" : dist[i]));
        }
    }
	
    public static void main(String[] args) {
        int vertices = 5;
        List<Edge> edges = Arrays.asList(
            new Edge(0, 1, -1),
            new Edge(0, 2, 4),
            new Edge(1, 2, 3),
            new Edge(1, 3, 2),
            new Edge(1, 4, 2),
            new Edge(3, 1, 1),
            new Edge(4, 3, -3)
        );
        int source = 0;
        bellmanFord(vertices, edges, source);
    }
}
```

## Преимущества

- Работает с отрицательными весами.
- Может обнаруживать циклы с отрицательным весом.


## Ограничения

- Работает медленнее, чем алгоритм Дейкстры, на графах без отрицательных рёбер.
- Не подходит для графов с отрицательными циклами (если нужно найти оптимальные пути).


## Применение

- Оптимизация маршрутов с негативными затратами.
- Анализ финансовых графов, где могут быть “выгодные” циклы.
- Проверка наличия циклов отрицательного веса в графе.

