**Алгоритм Дейкстры** — это жадный алгоритм для нахождения кратчайшего пути от одной вершины графа до всех остальных вершин. Используется в [[{TODO} Ориентированный граф||ориентированных]] и [[{TODO} Неориентированный граф||неориентированных графах]], где веса рёбер неотрицательны.


## Основная идея

1. Начать с начальной вершины (источник).
2. Постепенно исследовать соседние вершины, обновляя минимальные расстояния до них.
3. Выбирать на каждом шаге вершину с минимальным известным расстоянием и отмечать её как обработанную.
4. Повторять, пока все вершины не будут обработаны или не будут достигнуты целевые вершины.


## Входные данные

- **Граф:**  $G = (V, E)$ , где  $V$  — вершины,  $E$  — рёбра с весами.
- **Источник:** Вершина  $S$ , откуда начинается поиск.


## Выход

- Минимальные расстояния от источника  $S$  до всех остальных вершин.
- Кратчайший путь до заданной вершины (при необходимости).


## Алгоритм

1. **Инициализация:**
	1. Задать  $dist[v] = \infty$  для всех вершин  $v$ , кроме источника ( $dist[S] = 0$ ).
	2. Создать приоритетную очередь для хранения вершин и их расстояний.
	3. Все вершины считаются непосещёнными.
2. **Обработка вершины:**
	1. Извлечь вершину  $u$  с минимальным расстоянием  $dist[u]$  из очереди.
	2. Для каждого соседа  $v$  вершины  $u$ :
		1. Обновить расстояние  $dist[v] = \min(dist[v], dist[u] + weight(u, v))$ .
		2. Если расстояние изменилось, обновить очередь.
3. **Повторение:**
	1. Продолжать, пока очередь не пуста.
4. **Результат:**
	1. Массив  $dist$  содержит кратчайшие расстояния от  $S$  до всех остальных вершин.


## Сложность

**Временная сложность:**

   $O((V + E) \cdot \log V)$  при использовании очереди с приоритетом (где  $V$  — количество вершин,  $E$  — количество рёбер).
   
   $O(V^2)$ , если использовать матрицу смежности и обычный массив для поиска минимального расстояния.

**Пространственная сложность:**

   $O(V + E)$  для хранения графа и очереди.

## Имплементация

``` java
import java.util.*;

class DijkstraAlgorithm {
    static class Node implements Comparable<Node> {
        int vertex, distance;
        Node(int vertex, int distance) {
            this.vertex = vertex;
            this.distance = distance;
        }
        @Override
        public int compareTo(Node other) {
            return Integer.compare(this.distance, other.distance);
        }
    }
	
    public static int[] dijkstra(int vertices, List<List<Node>> graph, int source) {
        int[] dist = new int[vertices];
        Arrays.fill(dist, Integer.MAX_VALUE);
        dist[source] = 0;
        PriorityQueue<Node> pq = new PriorityQueue<>();
        pq.add(new Node(source, 0));
        boolean[] visited = new boolean[vertices];
        while (!pq.isEmpty()) {
            Node current = pq.poll();
            int u = current.vertex;
            if (visited[u]) continue;
            visited[u] = true;
            for (Node neighbor : graph.get(u)) {
                int v = neighbor.vertex;
                int weight = neighbor.distance;
                if (!visited[v] && dist[u] + weight < dist[v]) {
                    dist[v] = dist[u] + weight;
                    pq.add(new Node(v, dist[v]));
                }
            }
        }
        return dist;
    }
	
    public static void main(String[] args) {
        int vertices = 5;
        List<List<Node>> graph = new ArrayList<>();
        for (int i = 0; i < vertices; i++) graph.add(new ArrayList<>());
        graph.get(0).add(new Node(1, 1));
        graph.get(0).add(new Node(2, 4));
        graph.get(1).add(new Node(2, 2));
        graph.get(1).add(new Node(3, 6));
        graph.get(2).add(new Node(3, 3));
        int source = 0;
        int[] distances = dijkstra(vertices, graph, source);
        System.out.println("Кратчайшие расстояния от вершины " + source + ":");
        for (int i = 0; i < distances.length; i++) {
            System.out.println("До вершины " + i + ": " + distances[i]);
        }
    }
}
```


## Ограничения

Не работает с отрицательными весами рёбер. Если граф содержит отрицательные веса, используйте [[Алгоритм Беллмана-Форда]].


## Применение

- Оптимизация маршрутов (например, навигационные системы).
- Планирование сетей (телекоммуникации, электрические сети).
- Задачи маршрутизации в интернете.